<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;

class CreateDoctorsTables extends Migration {

	/**
	 * Run the migrations.
	 *
	 * @return void
	 */
	public function up()
	{
        // Шардинг: CREATE TABLE doctors_{$clinic_id % 5}
        for ($clinicId = 0; $clinicId < 5; ++$clinicId) {
            Schema::create('doctors_' . $clinicId, function(Blueprint $table)
            {
                $table->increments('id');
                $table->integer('clinic_id')->unsigned()->index('clinic_id');
                $table->string('name', 100);
            });


            // Заполним тестовыми данными
            for ($i = 0; $i < 100; ++$i) {
                DB::table('doctors_' . $clinicId)->insert(
                    [
                        'clinic_id' => $clinicId,
                        'name'      => self::_getRandomName(),
                    ]
                );
            }
        }
	}


	/**
	 * Reverse the migrations.
	 *
	 * @return void
	 */
	public function down()
	{
		Schema::drop('doctors_0');
	}
    
    private static function _getRandomName()
    {
        $manNames = [
          'Александр', 'Максим', 'Артём', 'Дмитрий', 'Иван',
            'Даниил', 'Михаил', 'Никита', 'Кирилл', 'Андрей'
        ];
        
        $womanNames = [
            'Анастасия', 'Мария', 'Дарья', 'Елизавета',
            'Анна', 'Ксения', 'Полина', 'София', 'Екатерина', 'Виктория'
        ];

        $surname = self::_getRandomSurname();

        if (mt_rand(0, 1)) {
            $name = $surname . $manNames[mt_rand(0, count($manNames) - 1)];
        } else {
            $name = str_replace(['ов ', 'ев ', 'ин '], ['ова ', 'ева ', 'ина '], $surname)
                . $womanNames[mt_rand(0, count($manNames) - 1)];
        }

        return $name;
    }

    private static function _getRandomSurname()
    {
        $surnames = [
            'Абрамов ',
            'Авдеев ',
            'Агафонов ',
            'Аксёнов ',
            'Александров ',
            'Алексеев ',
            'Андреев ',
            'Анисимов ',
            'Антонов ',
            'Артемьев ',
            'Архипов ',
            'Афанасьев ',
            'Баранов ',
            'Белов ',
            'Белозёров ',
            'Белоусов ',
            'Беляев ',
            'Беляков ',
            'Беспалов ',
            'Бирюков ',
            'Блинов ',
            'Блохин ',
            'Бобров ',
            'Бобылёв ',
            'Богданов ',
            'Большаков ',
            'Борисов ',
            'Брагин ',
            'Буров',
            'Быков ',
            'Васильев ',
            'Веселов ',
            'Виноградов ',
            'Вишняков ',
            'Владимиров ',
            'Власов ',
            'Волков ',
            'Воробьёв ',
            'Воронов ',
            'Воронцов ',
            'Гаврилов ',
            'Галкин ',
            'Герасимов ',
            'Голубев ',
            'Горбачёв ',
            'Горбунов ',
            'Гордеев ',
            'Горшков ',
            'Григорьев ',
            'Гришин ',
            'Громов ',
            'Гуляев ',
            'Гурьев ',
            'Гусев ',
            'Гущин ',
            'Давыдов ',
            'Данилов ',
            'Дементьев ',
            'Денисов ',
            'Дмитриев ',
            'Доронин ',
            'Дорофеев ',
            'Дроздов ',
            'Дьячков ',
            'Евдокимов ',
            'Евсеев ',
            'Егоров ',
            'Елисеев ',
            'Емельянов ',
            'Ермаков ',
            'Ершов ',
            'Ефимов ',
            'Ефремов ',
            'Жданов ',
            'Жуков ',
            'Журавлёв ',
            'Зайцев ',
            'Захаров ',
            'Зимин ',
            'Зиновьев ',
            'Зуев ',
            'Зыков ',
            'Иванков ',
            'Иванов ',
            'Игнатов ',
            'Игнатьев ',
            'Ильин ',
            'Исаев ',
            'Исаков ',
            'Кабанов ',
            'Казаков ',
            'Калашников ',
            'Калинин ',
            'Капустин ',
            'Карпов ',
            'Кириллов ',
            'Киселёв ',
            'Князев ',
            'Ковалёв ',
            'Козлов ',
            'Колесников ',
            'Колобов ',
            'Комаров ',
            'Комиссаров ',
            'Кондратьев ',
            'Коновалов ',
            'Кононов ',
            'Константинов ',
            'Копылов ',
            'Корнилов ',
            'Королёв ',
            'Костин ',
            'Котов ',
            'Кошелев ',
            'Красильников ',
            'Крылов ',
            'Крюков ',
            'Кудрявцев ',
            'Кудряшов ',
            'Кузнецов ',
            'Кузьмин ',
            'Кулагин ',
            'Кулаков ',
            'Куликов ',
            'Лаврентьев ',
            'Лазарев ',
            'Лапин ',
            'Ларионов ',
            'Лебедев ',
            'Лихачёв ',
            'Лобанов ',
            'Логинов ',
            'Лукин ',
            'Лыткин ',
            'Макаров ',
            'Максимов ',
            'Мамонтов ',
            'Марков ',
            'Мартынов ',
            'Маслов ',
            'Матвеев ',
            'Медведев ',
            'Мельников ',
            'Меркушев ',
            'Миронов ',
            'Михайлов ',
            'Михеев ',
            'Мишин ',
            'Моисеев ',
            'Молчанов ',
            'Морозов ',
            'Муравьёв ',
            'Мухин ',
            'Мышкин ',
            'Мясников ',
            'Назаров ',
            'Наумов ',
            'Некрасов ',
            'Нестеров ',
            'Никитин ',
            'Никифоров ',
            'Николаев ',
            'Никонов ',
            'Новиков ',
            'Носков ',
            'Носов ',
            'Овчинников ',
            'Одинцов ',
            'Орехов ',
            'Орлов ',
            'Осипов ',
            'Павлов ',
            'Панов ',
            'Панфилов ',
            'Пахомов ',
            'Пестов ',
            'Петров ',
            'Петухов ',
            'Поляков ',
            'Пономарёв ',
            'Попов ',
            'Потапов ',
            'Прохоров ',
            'Рогов ',
            'Родионов ',
            'Рожков ',
            'Романов ',
            'Русаков ',
            'Рыбаков ',
            'Рябов ',
            'Савельев ',
            'Савин ',
            'Сазонов ',
            'Самойлов ',
            'Самсонов ',
            'Сафонов ',
            'Селезнёв ',
            'Селиверстов ',
            'Семёнов ',
            'Сергеев ',
            'Сидоров ',
            'Силин ',
            'Симонов ',
            'Ситников ',
            'Соболев ',
            'Соколов ',
            'Соловьёв ',
            'Сорокин ',
            'Степанов ',
            'Стрелков ',
            'Субботин ',
            'Суворов ',
            'Суханов ',
            'Сысоев ',
            'Тарасов ',
            'Терентьев ',
            'Тетерин ',
            'Тимофеев ',
            'Титов ',
            'Тихонов ',
            'Третьяков ',
            'Трофимов ',
            'Туров ',
            'Уваров ',
            'Устинов ',
            'Фадеев ',
            'Фёдоров ',
            'Федосеев ',
            'Федотов ',
            'Филатов ',
            'Филиппов ',
            'Фокин ',
            'Фомин ',
            'Фомичёв ',
            'Фролов ',
            'Харитонов ',
            'Хохлов ',
            'Цветков ',
            'Чернов ',
            'Шарапов ',
            'Шаров ',
            'Шашков ',
            'Шестаков ',
            'Шилов ',
            'Ширяев ',
            'Шубин ',
            'Щербаков ',
            'Щукин ',
            'Юдин',
            'Яковлев ',
            'Якушев ',
        ];

        return $surnames[mt_rand(0, count($surnames) - 1)];
    }
}
